Revit 2027 API
AnalyticalPanel.Create Method
Overload List
Name | Description
Create(Document, CurveLoop) |  Creates a new instance of an Analytical Panel within the project.
Create(Document, Curve, XYZ) |  Creates a new instance of an Analytical Panel within the project.
Top
See Also
Reference
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace